[zscalerapi-zia-audit]
SHOULD_LINEMERGE = 0
TRUNCATE=0
category = Network & Security
description = Zscaler ZIA Admin Audit Logs
pulldown_type = 1
FIELDALIAS-cloudname = "log{}.AA in Cloud"  AS  cloudname
FIELDALIAS-action = "log{}.Action"  AS  action
FIELDALIAS-category = "log{}.Category"  AS  category
FIELDALIAS-src_ip = "log{}.Client IP"  AS  src_ip
FIELDALIAS-interface = "log{}.Interface"  AS  interface
FIELDALIAS-post_action = "log{}.Post Action"  AS  post_action
FIELDALIAS-pre_action = "log{}.Pre Action"  AS  pre_action
FIELDALIAS-resource = "log{}.Resource"  AS  resource
FIELDALIAS-result = "log{}.Result"  AS  result
FIELDALIAS-sub_category = "log{}.Subcategory"  AS  sub_category
FIELDALIAS-time = "log{}.Time"  AS  time
FIELDALIAS-user = "log{}.User"  AS  user

[source::...ta-zscaler_cim*.log*]
sourcetype = ta:zscalercim:log

[source::...ta_zscaler_cim*.log*]
sourcetype = ta:zscalercim:log

[zscalerapi-zia-sandbox]
SHOULD_LINEMERGE = 0
TRUNCATE=0
category = Network & Security
description = Zscaler Sandbox detonation reports
pulldown_type = 1
FIELDALIAS-class_category = "Full Details.Classification.Category"  AS class_category
FIELDALIAS-class_detect_mal = "Full Details.Classification.DetectedMalware"  AS class_detect_mal
FIELDALIAS-class_score = "Full Details.Classification.Score"  AS class_score
FIELDALIAS-class_type = "Full Details.Classification.Type"  AS class_type
FIELDALIAS-exploit_risk = "Full Details.Exploit{}.Risk"  AS exploit_risk
FIELDALIAS-exploit_sig = "Full Details.Exploit{}.Signature"  AS exploit_sig
FIELDALIAS-exploit_sig_source = "Full Details.Exploit{}.SignatureSources{}"  AS exploit_sig_source
FIELDALIAS-file_cert = "Full Details.FileProperties.DigitalCerificate"  AS file_cert
FIELDALIAS-file_size = "Full Details.FileProperties.FileSize"  AS file_size
FIELDALIAS-file_type = "Full Details.FileProperties.FileType"  AS file_type
FIELDALIAS-file_cert_issuer = "Full Details.FileProperties.Issuer"  AS file_cert_issuer
FIELDALIAS-file_hash = "Full Details.FileProperties.MD5"  AS file_hash
FIELDALIAS-md5 = "Full Details.FileProperties.MD5"  AS md5
FIELDALIAS-file_cert_root = "Full Details.FileProperties.RootCA"  AS file_cert_root
FIELDALIAS-sha1 = "Full Details.FileProperties.SHA1"  AS sha1
FIELDALIAS-ssdeep = "Full Details.FileProperties.SSDeep"  AS ssdeep
FIELDALIAS-sha2 = "Full Details.FileProperties.Sha256"  AS sha2
FIELDALIAS-sha256 = "Full Details.FileProperties.Sha256"  AS sha256
FIELDALIAS-net_risk = "Full Details.Networking{}.Risk"  AS net_risk
FIELDALIAS-net_sig = "Full Details.Networking{}.Signature"  AS net_sig
FIELDALIAS-net_sig_source = "Full Details.Networking{}.SignatureSources{}"  AS net_sig_source
FIELDALIAS-country = "Full Details.Origin.Country"  AS country
FIELDALIAS-language = "Full Details.Origin.Language"  AS language
FIELDALIAS-orig_risk = "Full Details.Origin.Risk"  AS orig_risk
FIELDALIAS-persist_risk = "Full Details.Persistence{}.Risk"  AS persist_risk
FIELDALIAS-persist_sig = "Full Details.Persistence{}.Signature"  AS persist_sig
FIELDALIAS-persist_sig_source = "Full Details.Persistence{}.SignatureSources{}"  AS persist_sig_source
FIELDALIAS-bypass_risk = "Full Details.SecurityBypass{}.Risk"  AS bypass_risk
FIELDALIAS-bypass_sig = "Full Details.SecurityBypass{}.Signature"  AS bypass_sig
FIELDALIAS-bypass_sig_source = "Full Details.SecurityBypass{}.SignatureSources{}"  AS bypass_sig_source
FIELDALIAS-stealth_risk = "Full Details.Stealth{}.Risk"  AS stealth_risk
FIELDALIAS-stealth_sig = "Full Details.Stealth{}.Signature"  AS stealth_sig
FIELDALIAS-stealth_sig_source = "Full Details.Stealth{}.SignatureSources{}"  AS stealth_sig_source
FIELDALIAS-category = "Full Details.Summary.Category"  AS category
FIELDALIAS-duration = "Full Details.Summary.Duration"  AS duration
FIELDALIAS-start_time = "Full Details.Summary.StartTime"  AS start_time
FIELDALIAS-status = "Full Details.Summary.Status"  AS status
FIELDALIAS-risk = "Full Details.SystemSummary{}.Risk"  AS risk
FIELDALIAS-signature = "Full Details.SystemSummary{}.Signature"  AS signature
FIELDALIAS-sig_source = "Full Details.SystemSummary{}.SignatureSources{}"  AS sig_source

[zscalernss-alerts]
pulldown_type = 1
category = Network & Security
description = Zscaler NSS System Alerts

[source::...BDdemo_modalert.log*]
sourcetype = ta:zscalercim:log

[zscalernss-dns]
EVAL-vendor_product = Zscaler_ZIA_Firewall
FIELDALIAS-clt_sip_as_src = clt_sip AS src
FIELDALIAS-clt_sip_as_src_ip = clt_sip AS src_ip
FIELDALIAS-dns_req_as_query = dns_req AS query
FIELDALIAS-dns_reqtype_as_record_type = dns_reqtype AS record_type
FIELDALIAS-dns_resp_as_answer = dns_resp AS answer
FIELDALIAS-durationms_as_response_time = durationms AS response_time
FIELDALIAS-srv_dip_as_dest = srv_dip AS dest
FIELDALIAS-srv_dip_as_dest_ip = srv_dip AS dest_ip
FIELDALIAS-srv_dport_as_dest_port = srv_dport AS dest_port
pulldown_type = 1
category = Network & Security
description = Zscaler DNS Control Logs

[zscalernss-web]
EVAL-action = lower(action)
EVAL-app = Zscaler
EVAL-dlp_type = "Inline Gateway"
EVAL-duration = clienttranstime + servertranstime
EVAL-dvc = "Zscaler Cloud Proxy"
EVAL-dvc_zone = "Cloud Proxy"
EVAL-vendor_product = "Zscaler_ZIA_Proxy"
FIELDALIAS-ClientIP_as_src = ClientIP AS src
FIELDALIAS-ClientIP_as_src_ip = ClientIP AS src_ip
FIELDALIAS-aob_gen_zscalernss_web_alias_1 = protocol AS transport
FIELDALIAS-aob_gen_zscalernss_web_alias_2 = user AS src_user
FIELDALIAS-aob_gen_zscalernss_web_alias_3 = dlpengine AS severity
FIELDALIAS-aob_gen_zscalernss_web_alias_4 = threatname AS signature
FIELDALIAS-aob_gen_zscalernss_web_alias_5 = contenttype AS http_content_type
FIELDALIAS-aob_gen_zscalernss_web_alias_6 = hostname AS dest
FIELDALIAS-clientpublicIP_as_src_translated_ip = clientpublicIP AS src_translated_ip
FIELDALIAS-clienttranstime_as_response_time = clienttranstime AS response_time
FIELDALIAS-department_as_src_user_bunit = department AS src_user_bunit
FIELDALIAS-dlpdictionaries_as_signature = dlpdictionaries AS signature
FIELDALIAS-filename_as_file_name = filename AS file_name
FIELDALIAS-md5_as_file_hash = md5 AS file_hash
FIELDALIAS-refererURL_as_http_referrer = refererURL AS http_referrer
FIELDALIAS-requestmethod_as_http_method = requestmethod AS http_method
FIELDALIAS-requestsize_as_bytes_in = requestsize AS bytes_in
FIELDALIAS-responsesize_as_bytes_out = responsesize AS bytes_out
FIELDALIAS-serverip_as_dest_ip = serverip AS dest_ip
FIELDALIAS-serverip_as_dest_translated_ip = translated_ip  hostname AS dest
FIELDALIAS-threatcategory_as_category = threatcategory AS category
FIELDALIAS-transactionsize_as_bytes = transactionsize AS bytes
FIELDALIAS-urlcategory_as_category = urlcategory AS category
FIELDALIAS-useragent_as_http_user_agent = useragent AS http_user_agent
REPORT-ta_builder_internal_use_kv_format_results_for_zscalernss_web = ta_builder_internal_use_kv_format_results_for_zscalernss_web
category = Network & Security
description = Zscaler Web/Proxy Logs
pulldown_type = 1

[zscalerlss-zpa-app]
EVAL-app = Zscaler
EVAL-vendor_product = Zscaler_ZPA
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_1 = ServerIP AS dest_ip
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_2 = ClientPublicIP AS src_ip
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_4 = Application AS app
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_5 = ServicePort AS dest_port
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_6 = ConnectorPort AS src_port
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_7 = Host AS dest
SHOULD_LINEMERGE = 0
category = Network & Security
description = Zscaler ZPA App Logs
pulldown_type = 1

[zscalerlss-zpa-auth]
EVAL-app = Zscaler
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_1 = Username AS user
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_3 = PublicIP AS src
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_4 = SessionStatus AS action
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_5 = Application AS app
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_6 = ServicePort AS dest_port
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_7 = ConnectorPort AS src_port
FIELDALIAS-aob_gen_zscalerlss_zpa_auth_alias_8 = Host AS dest
SHOULD_LINEMERGE = 0
category = Network & Security
description = Zscaler ZPA Auth Logs
pulldown_type = 1

[zscalerlss-zpa-connector]
EVAL-app = Zscaler
FIELDALIAS-aob_gen_zscalerlss_zpa_connector_alias_1 = Application AS app
FIELDALIAS-aob_gen_zscalerlss_zpa_connector_alias_2 = ServicePort AS dest_port
FIELDALIAS-aob_gen_zscalerlss_zpa_connector_alias_3 = ConnectorPort AS src_port
FIELDALIAS-aob_gen_zscalerlss_zpa_connector_alias_4 = Host AS dest
SHOULD_LINEMERGE = 0
category = Network & Security
description = Zscaler ZPA Connector Logs
pulldown_type = 1

[zscalernss-fw]
EVAL-action = eval action=if(like(action, "%Allow%"), "allowed", action)
EVAL-app = Zscaler
EVAL-bytes = inbytes + outbytes
EVAL-vendor_product = Zscaler_ZIA_Firewall
FIELDALIAS-cdip_as_dest_ip = cdip AS dest_ip
FIELDALIAS-cdport_as_dest_port = cdport AS dest_port
FIELDALIAS-csip_as_src = csip AS src
FIELDALIAS-csip_as_src_ip = csip AS src_ip
FIELDALIAS-csport_as_src_port = csport AS src_port
FIELDALIAS-csport_as_src_translated_port = csport AS src_translated_port
FIELDALIAS-inbytes_as_bytes_in = inbytes AS bytes_in
FIELDALIAS-locationname_as_src_zone = locationname AS src_zone
FIELDALIAS-outbytes_as_bytes_out = outbytes AS bytes_out
FIELDALIAS-proto_as_protocol = proto AS protocol
FIELDALIAS-proto_as_transport = proto AS transport
FIELDALIAS-sdip_as_dest = sdip AS dest
FIELDALIAS-sdip_as_dest_translated_ip = sdip AS dest_translated_ip
FIELDALIAS-sdport_as_dest_translated_port = sdport AS dest_translated_port
FIELDALIAS-tsip_as_src_translated_ip = tsip AS src_translated_ip
category = Network & Security
description = Zscaler Firewall Logs
pulldown_type = 1

[zscalerlss-zpa-bba]
EVAL-app = Zscaler
EVAL-vendor_product = Zscaler_ZPA
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_1 = ServerIP AS dest_ip
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_2 = ClientPublicIP AS src_ip
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_4 = Application AS app
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_5 = ServicePort AS dest_port
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_6 = ConnectorPort AS src_port
FIELDALIAS-aob_gen_zscalerlss_zpa_app_alias_7 = Host AS dest
SHOULD_LINEMERGE = 0
category = Network & Security
description = Zscaler ZPA Browser Access Logs
pulldown_type = 1

[zscalernss-tunnel] 
category = Network & Security 
description = Zscaler NSS Tunnel/Network logs 
pulldown_type = 1
